In [3]:
import pandas as pd
import numpy as np

/Users/ahmedabukar/opt/anaconda3/lib/python3.9/site-packages/pandas/core/arrays/masked.py:60: UserWarning: Pandas requires version '1.3.6' or newer of 'bottleneck' (version '1.3.2' currently installed).
  from pandas.core import (

In [4]:
df = pd.DataFrame([{'product_id':23, 'name':'computer', 'wholesale_price': 500, 
                 'retail_price':1000, 'sales':100},
               {'product_id':96, 'name':'Python Workout', 'wholesale_price': 35,
                'retail_price':75, 'sales':1000},
               {'product_id':97, 'name':'Pandas Workout', 'wholesale_price': 35,
                'retail_price':75, 'sales':500},
               {'product_id':15, 'name':'banana', 'wholesale_price': 0.5,
                'retail_price':1, 'sales':200},
               {'product_id':87, 'name':'sandwich', 'wholesale_price': 3,
                'retail_price':5, 'sales':300},
               ])
df1 = df.copy()

In [5]:
df["current_net"] = ((df["retail_price"] * df["wholesale_price"]) * df["sales"])

In [6]:
df

,product_id,name,wholesale_price,retail_price,sales,current_net
0,23,computer,500.0,1000,100,50000000.0
1,96,Python Workout,35.0,75,1000,2625000.0
2,97,Pandas Workout,35.0,75,500,1312500.0
3,15,banana,0.5,1,200,100.0
4,87,sandwich,3.0,5,300,4500.0

In [7]:
df.loc[df["current_net"] > 20000, "current_net"] * 0.75

0    37500000.0
1     1968750.0
2      984375.0
Name: current_net, dtype: float64

In [8]:
def create_with_condition(val):
    if val > 20000:
        return val * 0.75
    return val

In [9]:
df["after_25"] = df["current_net"].apply(create_with_condition)

In [10]:
df[["current_net", "after_25"]].sum()

current_net    53942100.0
after_25       40457725.0
dtype: float64

In [11]:
def create_with_two_conditions(val):
    if val > 80:
        return val * 0.75
    elif 80 > val > 30:
        return val * 0.90
    return val

In [12]:
df["after_25_10"] = df["retail_price"].apply(create_with_two_conditions)

In [13]:
df[["after_25_10", "current_net"]].sum()

after_25_10         891.0
current_net    53942100.0
dtype: float64

In [14]:
df['after_tax'] = pd.cut(df['retail_price'], 
                   bins=[0, 30, 80, df['retail_price'].max()],
                   labels=[1, 0.9, 0.75]).astype(np.float64)
df["after_tax"]

0    0.75
1    0.90
2    0.90
3    1.00
4    1.00
Name: after_tax, dtype: float64

In [15]:
pd.options.display.float_format = '{:,.2f}'.format

In [16]:
df1

   product_id            name  wholesale_price  retail_price  sales
0          23        computer           500.00          1000    100
1          96  Python Workout            35.00            75   1000
2          97  Pandas Workout            35.00            75    500
3          15          banana             0.50             1    200
4          87        sandwich             3.00             5    300

In [17]:
dict_values = {"product_id" : [24, 16, 17],
               "name" : ["Phone", "Apple", "Pear"],
               "wholesale_price" : [200, 0.5, 0.6],
               "retail_price" : [500, 1, 1.2]}

In [18]:
df2 = pd.DataFrame(dict_values)

In [19]:
df2

   product_id   name  wholesale_price  retail_price
0          24  Phone           200.00        500.00
1          16  Apple             0.50          1.00
2          17   Pear             0.60          1.20

In [20]:
df2["sales"] = [600, 1.5, 2.5]

In [21]:
new_df = pd.concat([df1, df2], ignore_index=True)

In [22]:
new_df.loc[8,"product_id"] = 99

In [23]:
new_df.loc[8, "name":"sales"] = ["pineapple", 20, 25, 500]

In [24]:
new_df["product_id"] = new_df["product_id"].astype(np.int32)

In [25]:
new_df

   product_id            name  wholesale_price  retail_price    sales
0          23        computer           500.00      1,000.00   100.00
1          96  Python Workout            35.00         75.00 1,000.00
2          97  Pandas Workout            35.00         75.00   500.00
3          15          banana             0.50          1.00   200.00
4          87        sandwich             3.00          5.00   300.00
5          24           Phone           200.00        500.00   600.00
6          16           Apple             0.50          1.00     1.50
7          17            Pear             0.60          1.20     2.50
8          99       pineapple            20.00         25.00   500.00

In [26]:
new_df["department"] = ["electronics", "books", "books", "food", "food", "electronics", 
                        "electronics", "food", "food"]

In [27]:
new_df["current_net"] = (new_df["retail_price"] - new_df["wholesale_price"]) * new_df["sales"]

In [28]:
#then show descriptive statistics for the current_net on food products.
new_df.loc[new_df["department"] == "food", "current_net"].describe()

count       4.00
mean      800.38
std     1,162.98
min         1.50
25%        75.38
50%       350.00
75%     1,075.00
max     2,500.00
Name: current_net, dtype: float64

In [29]:
new_df

,product_id,name,wholesale_price,retail_price,sales,department,current_net
0,23,computer,500.00,"1,000.00",100.00,electronics,"50,000.00"
1,96,Python Workout,35.00,75.00,"1,000.00",books,"40,000.00"
2,97,Pandas Workout,35.00,75.00,500.00,books,"20,000.00"
3,15,banana,0.50,1.00,200.00,food,100.00
4,87,sandwich,3.00,5.00,300.00,food,600.00
5,24,Phone,200.00,500.00,600.00,electronics,"180,000.00"
6,16,Apple,0.50,1.00,1.50,electronics,0.75
7,17,Pear,0.60,1.20,2.50,food,1.50
8,99,pineapple,20.00,25.00,500.00,food,"2,500.00"

In [30]:
#find the IDs and names of products that have sold more than the average number of units.
new_df.loc[new_df["sales"] > new_df["sales"].mean(), ["product_id", "name"]]

   product_id            name
1          96  Python Workout
2          97  Pandas Workout
5          24           Phone
8          99       pineapple

In [31]:
new_df.query("sales > sales.mean()")[["product_id", "name"]]

   product_id            name
1          96  Python Workout
2          97  Pandas Workout
5          24           Phone
8          99       pineapple

In [32]:
#Show the ID and name of products whose net income is in the top 25% quantile.
new_df.query("current_net < current_net.quantile(0.25)")[["product_id", "name"]]

   product_id   name
6          16  Apple
7          17   Pear

In [33]:
#Show the ID and name of products with lower-than-average sales numbers 
#and whose wholesale price is greater than the average
(new_df.query("sales < sales.mean() & wholesale_price > wholesale_price.mean()")
 [["product_id", "name"]])

   product_id      name
0          23  computer

In [34]:
#Show the name and wholesale and retail prices of products with IDs between 80 and 100 
#and that sold fewer than 400 units.
new_df.query("(100 > product_id > 80) & (sales < 400)")

,product_id,name,wholesale_price,retail_price,sales,department,current_net
4,87,sandwich,3.00,5.00,300.00,food,600.00